# -*- coding: utf-8 -*-

# 所有业务名
service = ['普通护照签发、换发、补发及加注-首次申请护照',
           '普通护照签发、换发、补发及加注-护照加注',
           '普通护照签发、换发、补发及加注-护照补发',
           '普通护照签发、换发、补发及加注-换发护照',
           '养犬登记',
           '港澳台居民定居证明签发',
           '港澳台居民定居证明签发',
           '大陆及台湾居民往来两地通行证及签注-台湾居民来往大陆通行证签发',
           '大陆及台湾居民往来两地通行证及签注-大陆居民往来台湾通行证签发及签注',
           '出入境通行证签发',
           '内地居民前往港澳通行证、往来港澳通行证和签注核发',
           '户外广告及临时悬挂、设置标语或者宣传品许可-户外广告设施许可（不含公交候车亭附属广告及公交车体广告设施）（市级权限委托市内六区实施）',
           '设置医疗机构许可和执业登记、变更-医疗机构执业登记、变更-执业登记',
           '食品生产许可-食品（不含保健食品）生产许可证核发、变更、延续（按区级权限实施）-核发',
           '药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）-核发（延续）',
           '洪水影响评价许可-河道管理范围内建设项目工程建设方案许可',
           '户外广告及临时悬挂、设置标语或者宣传品许可-临时悬挂、设置标语或者宣传品许可',
           '机动车维修经营备案',
           '固定资产投资项目合理用能审查',
           '建设工程施工许可-建筑工程施工许可',
           '医师执业注册许可-医师执业注册-执业注册',
           '新建住宅商品房准许交付使用许可'
           ]

# 各业务的关键词的权重
l = [
    {'普通护照签发、换发、补发及加注-首次申请护照': 100, '首次申请护照': 100, '首次': 50, '护照': 50, '外国': 10,
     '定居': 10, '探亲': 10, '学习': 10,
     '就业': 10, '旅行': 10, '商务活动': 10,
     '非公务原因': 10, '出国': 10, '申请': 10, '公民': 10},
    {'普通护照签发、换发、补发及加注-护照加注': 100, '护照加注': 100, '曾用名': 30, '曾用名加注': 50, '繁体': 30,
     '汉字': 30, '英文': 30, '多音字': 30,
     '非标准': 30, '汉语': 30, '发音': 30,
     '姓名': 30, '姓名加注': 50, '曾持照': 30, '加注项': 50, '加注': 50, '曾持照加注': 50, '护照': 50, '外国': 10,
     '定居': 10, '探亲': 10,
     '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '公民': 10},
    {'普通护照签发、换发、补发及加注-护照补发': 100, '护照补发': 100, '损毁': 60, '不能': 10, '使用': 10, '被盗': 60,
     '遗失': 60, '补发': 60, '护照': 50,
     '外国': 10, '定居': 10, '探亲': 10,
     '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '公民': 10},
    {'普通护照签发、换发、补发及加注-换发护照': 100, '换发护照': 100, '有效期': 30, '届满': 30, '签证页': 30, '使用': 10,
     '完毕': 10, '换发': 50, '护照': 50,
     '外国': 10, '定居': 10, '探亲': 10, '延期': 30, '更换': 40,
     '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '公民': 10},
    {'养犬登记': 100, '养犬': 100, '饲养': 50, '犬': 50, '登记': 10, '狗': 50, '寄养': 50},
    {'港澳台居民定居证明签发': 100, '港澳台居民来大陆定居': 100, '台湾': 50, '定居': 50, '大陆': 30, '居民': 10,
     '申请': 10},
    {'港澳台居民定居证明签发': 100, '前往港澳定居后返回内地定居': 100, '香港': 50, '澳门': 50, '定居': 50, '返回': 10,
     '内地': 30, '居民': 10},
    {'大陆及台湾居民往来两地通行证及签注-台湾居民来往大陆通行证签发': 100, '台湾居民来往大陆通行证': 100, '台湾': 50,
     '居民': 30, '来往': 10, '大陆': 30, '内地': 30,
     '通行证': 50, '签发': 10, '申请': 10, '换发': 10,
     '补发': 10,
     '台胞证': 50, '委托': 10, '监护人': 10},
    {'大陆及台湾居民往来两地通行证及签注-大陆居民往来台湾通行证签发及签注': 100, '大陆居民往来台湾通行证': 100,
     '台湾': 50, '居民': 30, '往来': 10, '大陆': 30, '内地': 30,
     '通行证': 50, '签发': 10, '签注': 10},
    {'出入境通行证签发': 100, '出入境通行证': 100, '出入境': 50, '通行证': 50, '签发': 10, '申请人': 10, '国籍': 30,
     '冲突': 30, '不便': 10, '持用': 10,
     '普通': 10,
     '护照': 10, '港澳': 10, '香港': 10, '澳门': 10, '居民': 10, '内地': 10, '遗失': 10, '损毁': 10, '失效': 10,
     '返回': 10},
    {'内地居民前往港澳通行证、往来港澳通行证和签注核发': 100, '内地居民往来港澳通行证': 100, '内地': 30, '大陆': 30,
     '居民': 30, '往来': 10, '港澳': 40, '通行证': 50,
     '香港': 30, '澳门': 30, '前往': 10,
     '签注': 50, '核发': 10},
    {
        '户外广告及临时悬挂、设置标语或者宣传品许可-户外广告设施许可（不含公交候车亭附属广告及公交车体广告设施）（市级权限委托市内六区实施）': 100,
        '户外广告设施': 100, '户外广告设施许可': 100, ' 符合': 30, '户外': 50, '广告': 80, '门头': 80, '牌匾': 80,
        '招牌': 80, '设置': 30, '规划': 30, '周围': 30, '建筑': 30, '街景': 30, '环境': 20, '协调': 10, '规范': 20,
        '新技术': 20, '新材料': 20, '设施': 10, '许可': 10},
    {'设置医疗机构许可和执业登记、变更-医疗机构执业登记、变更-执业登记': 100, '医疗机构执业登记': 100,
     '医疗机构': 60, '批准书': 10, '专业': 10, '卫生技术': 10, '人员': 10, '门诊部': 60, '执业': 30, '登记': 30,
     '从业': 30, '职业': 30, '备案': 30, '注册': 30, '综合医院': 60, '诊疗': 40,
     '口腔门诊部': 60, '综合门诊部': 60, '中医门诊部': 60, '专科医院': 60, '互联网医院': 60},
    {'食品生产许可-食品（不含保健食品）生产许可证核发、变更、延续（按区级权限实施）-核发': 100, '食品生产许可证核发': 100,
     '生产': 20, '食品': 50, '食物': 50, '品种': 10, '数量': 10, '原料': 10, '加工': 20, '包装': 10,
     '许可': 40, '消毒': 10, '工艺流程': 10, '成品': 10, '核发': 30, '注册': 30, '登记': 30, '许可证': 40},
    {'药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）-核发（延续）': 100, '药品经营许可证核发': 100,
     '药师': 40, '药学技术': 40, '人员': 10, '经营': 30, '药品': 50, '营业': 30, '场所': 10, '药物': 50, '核发': 30,
     '注册': 30, '登记': 30, '许可证': 40, '许可': 40},
    {
        '洪水影响评价许可-河道管理范围内建设项目工程建设方案许可': 100,
        '河道管理范围内建设项目工程建设方案许可': 100,
        '洪水': 30, "影响": 10, '评估': 30, '评定': 30, '测评': 30, '许可': 30, '注册': 30, '登记': 30,
        '许可证': 40, '河道': 40, "管理范围": 30, '项目': 10, '工程': 40, '建设': 10,
        '方案': 30},
    {
        '户外广告及临时悬挂、设置标语或者宣传品许可-临时悬挂、设置标语或者宣传品许可': 100,
        '临时悬挂、设置标语或者宣传品许可': 100,
        '城区': 30, '范围': 10, '城市': 30, '庆典': 30,
        '户外': 30, '室外': 30, '广告': 60, '临时': 40, '悬挂': 60, '设置': 30, '标语': 60, '宣传品': 60, '许可': 10},
    {
        '机动车维修经营备案': 100, '机动车维修备案': 100,
        '机动车': 40, '汽车': 40, '维修': 40, '修理': 40,
        '运输': 30, '经营': 50, '运营': 50, '备案': 30, '汽修店': 80
    },
    {
        '固定资产投资项目合理用能审查': 100, '固定资产用能审查': 100, '能评': 100, '固定资产': 60, '用能': 40,
        '审查': 50, '审察': 50, '审鉴': 50, '评估': 50, '新建': 30, '改建': 30, '扩建': 30},
    {
        '建设工程施工许可-建筑工程施工许可': 100, '建筑工程施工许可': 100,
        '建筑工程': 50, '施工': 30, '征收': 30, '房屋': 10, '规划区': 30,
        '施工图': 30, '许可': 20, '注册': 20, '登记': 20,
        '许可证': 20, '施工证': 80, '开工证': 80, '装修改造施工证': 80, '开工手续': 80},
    {
        '医师执业注册许可-医师执业注册-执业注册': 100, '医师执业注册': 100, '医师': 50, '医生': 50, '大夫': 50,
        '资格': 30,
        '注册': 20, '执业': 40, '疾病': 20, '医疗': 10, '医师注册': 100, '医师执业证': 90},
    {
        '新建住宅商品房准许交付使用许可': 100, '新建住宅商品房准许交付': 100,
        '新建住宅': 50, '商品房': 50, '准许': 30, '交付': 40
    }

]
requirement_weight = l
# 各业务的权重值最大的关键词
slot_max_weight = {'首次申请护照': 100, '护照加注': 100, '护照补发': 100, '换发护照': 100,
                   '养犬': 100,
                   '台湾居民来大陆定居': 100,
                   '前往港澳定居后返回内地定居': 100, '台湾居民来往大陆通行证': 100, '大陆居民往来台湾通行证': 100,
                   '出入境通行证': 100,
                   '内地居民往来港澳通行证': 100,
                   '户外广告设施许可': 100, '医疗机构执业登记': 100, '食品生产许可证核发': 100,
                   '药品经营许可证核发': 100,
                   '河道管理范围内建设项目工程建设方案许可': 100,
                   '临时悬挂、设置标语或者宣传品许可': 100,
                   '机动车维修备案': 100,
                   '固定资产用能审查': 100, '建筑工程施工许可': 100, '医师执业注册': 100,
                   '新建住宅商品房准许交付': 100
                   }

action_set = {'request': 0, 'inform': 1, 'closing': 2, 'deny': 3}
